In [1]:
import pandas as pd
import numpy as np

In [12]:
s1 = pd.Series([4,7,-5,3]) #索引为默认值
print(s1)

0    4
1    7
2   -5
3    3
dtype: int64

In [13]:
s1.values #series的值

array([ 4,  7, -5,  3])

In [14]:
s1.index #查看索引

RangeIndex(start=0, stop=4, step=1)

In [16]:
s2 = pd.Series([4.0,6.5,-0.5,4.2],index=['d','b','a','c']) #自定义索引
print(s2)

d    4.0
b    6.5
a   -0.5
c    4.2
dtype: float64

In [18]:
s2['a']

-0.5

In [22]:
s2[['a','b','c']]  # 同时索引n个

a   -0.5
b    6.5
c    4.2
dtype: float64

In [23]:
'b' in s2

True

In [26]:
#series 可以看成定长有序字典
dicl = {'apple':5,'pen':3,'applepen':10}
s3 = pd.Series(dicl)
print(s3)

apple        5
pen          3
applepen    10
dtype: int64

In [32]:
#DataFrame
data = {
    'year':[2014,2015,2016,2017],
    'income':[1000,30000,50000,80000],
    'pay':[5000,20000,30000,30000]
}
df1 = pd.DataFrame(data)
df1

   year  income    pay
0  2014    1000   5000
1  2015   30000  20000
2  2016   50000  30000
3  2017   80000  30000

In [39]:
df2 = pd.DataFrame(np.arange(12).reshape((2,6)))
df2

   0  1  2  3   4   5
0  0  1  2  3   4   5
1  6  7  8  9  10  11

In [40]:
df3 = pd.DataFrame(np.arange(12).reshape((3,4,)),index=['a','c','b'],columns=[2,33,44,5])#自定义表头
df3

   2   33  44  5
a   0   1   2   3
c   4   5   6   7
b   8   9  10  11

In [42]:
df1.columns

Index(['year', 'income', 'pay'], dtype='object')

In [43]:
df2.index

RangeIndex(start=0, stop=2, step=1)

In [44]:
df1.values

array([[ 2014,  1000,  5000],
       [ 2015, 30000, 20000],
       [ 2016, 50000, 30000],
       [ 2017, 80000, 30000]])

In [46]:
df1.describe() #各种属性

              year        income           pay
count     4.000000      4.000000      4.000000
mean   2015.500000  40250.000000  21250.000000
std       1.290994  33270.357177  11814.539066
min    2014.000000   1000.000000   5000.000000
25%    2014.750000  22750.000000  16250.000000
50%    2015.500000  40000.000000  25000.000000
75%    2016.250000  57500.000000  30000.000000
max    2017.000000  80000.000000  30000.000000

In [48]:
df1.T #转置

           0      1      2      3
year    2014   2015   2016   2017
income  1000  30000  50000  80000
pay     5000  20000  30000  30000

In [49]:
df3

   2   33  44  5
a   0   1   2   3
c   4   5   6   7
b   8   9  10  11

In [52]:
df3.sort_index(axis=1) #对列排序

   2   5   33  44
a   0   3   1   2
c   4   7   5   6
b   8  11   9  10

In [53]:
df3.sort_index(axis=0)#兑行排序

   2   33  44  5
a   0   1   2   3
b   8   9  10  11
c   4   5   6   7

In [58]:
df3.sort_values(by=44) #对某列排序

   2   33  44  5
a   0   1   2   3
c   4   5   6   7
b   8   9  10  11